import pyqrcode
import png
from pyqrcode import QRCode


banner = ''' 

              ▄▄▄                                                      
████▄▀███■█   ████▄ ▄██■▄      ▄███▄▀███■▄ ████▄▀███■▄ ████▀▄▄▄▄▄      
████▓ ████▓   ░███▄▀████▓      ████▓ ████▓ ░███▓ ░ ██▓ ███■▄ ███■▄     
░░░░▒ ░░░░▓   ░░░░▓▐░░░░▓      ░░░░▓ ░░░░▓ ░░░░▒ ░░░░▒ ░░░░▓ ░░░░▓     
▒▓▒▒▒ ▓▒▒▒▒   ▒▒▒▒▒ ▀▒▒▀▀      ▒▓▒▒▒ ▓▒▒▒▒ ▒▒▒▒▒▀▀▀▀▀  ▒▒▒▒▒ ▒▒▒▒▓     
▓█▓▓░ █▒▓▒▒   ▓▓▓▒▒            ▓█▓▓▒ █▒▓▓▒ █▓▓▓▒ ░███▒ █▓▓▓▒ ▓▓▓▓▒     
█████▄█▓█▓░   ███▓░            █████▄█▓██░ ████░ ▓░░▓░ ███▓░ ██▓▓▒     
     ▄█████▄ ▄█████▄            ▄▄▄▄▄████▀ ▓████▄████░ ███▓░ ████░     

'''


print(banner)
link = input("Enter URL: ")
name = input("Enter filename to save (without extension): ")
url = pyqrcode.create(link)
url.png(f'{name}.png', scale=6)
print(f"[+] QR Code saved as {name}.png")
print("============================")
